app/controllers/home_controller.rb

SELECT "macs".* FROM "macs" ORDER BY sequence
---
  def index
    @macs = Mac.order('sequence')